# tap
tap 'homebrew/cask'
tap 'homebrew/homebrew-core'
tap 'homebrew/homebrew-bundle'
tap 'homebrew/cask-fonts'
tap 'ragingwind/homebrew-cask'

# bin 
brew 'mackup'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-git-prompt'
brew 'zsh-syntax-highlighting'
brew 'tmux'
brew 'coreutils'
brew 'tree'
brew 'mas'
brew 'wget'
brew 'neovim'
brew 'unar'
brew 'pyenv'
brew 'svn'

# utils
cask 'alfred'
cask 'bettertouchtool'
cask 'skype'
cask 'slack'
cask 'vlc'
cask 'webtorrent'
cask 'screenflow'
cask 'vysor'
cask 'kid3'
cask 'openemu-experimental'
cask 'sip'
cask 'disk-inventory-x'
cask 'spotify'
cask 'typora'
cask 'avibrazil-rdm'
cask 'movist'
cask 'vanilla'
cask 'kap'
cask 'zoom'
cask 'kindle'
cask 'hyper'
cask 'notion'
cask 'there'
cask 'google-backup-and-sync'
cask 'choosy'
cask 'tidal'
cask 'transmission-remote-gui'

# mas
mas "Microsoft Remote Desktop", id: 1295203466
mas "MindNode", id: 1289197285 

# browsers
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'chromium'
cask 'safari-technology-preview'
cask 'firefox'
cask 'firefox-nightly'
cask 'tor-browser'

# development
cask 'docker'
brew 'docker-compose'
cask 'iterm2'
cask 'android-studio'
cask 'android-file-transfer'
cask 'visual-studio-code'
brew 'java'
cask 'devdogs'
brew 'go'
cask 'imageoptim'
brew 'python3'
cask 'zeplin'
cask 'sketch'
brew 'cmake'
brew 'brotli'

# fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-fira-code'
cask 'font-fira-sans'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-roboto-mono-nerd-font'
cask 'font-roboto-mono-for-powerline'
cask 'font-victor-mono'
cask 'font-victor-mono-nerd-font'
