# tap
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'

# bin
brew 'mackup'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-git-prompt'
brew 'tmux'
brew 'coreutils'
brew 'tree'
brew 'mas'
brew 'wget'
brew 'vim'

# utils
cask 'alfred'
cask 'bettertouchtool'
cask 'amazon-drive'
cask 'licecap'
cask 'skype'
cask 'slack'
cask 'vlc'
cask 'webtorrent'
cask 'screenflow5'
cask 'vysor'
cask 'divvy'
cask 'kid3'
cask 'divvy'
cask 'openemu-experimental'
cask 'sip'
cask 'disk-inventory-x'
cask 'spotify'
cask 'gyazo'
cask 'microsoft-remote-desktop-beta'

# browsers
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'chromium'
cask 'safari-technology-preview'
cask 'firefox'
cask 'firefoxnightly'
cask 'torbrowser'

# development
cask 'docker'
cask 'iterm2'
cask 'android-studio'
cask 'android-file-transfer'
cask 'visual-studio-code'
cask 'visual-studio-code-insiders'
cask 'java'
cask 'devdogs'
brew 'go'
cask 'imagealpha'
cask 'imageoptim'

# fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-fira-code'
cask 'font-fira-sans'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-robotomono-nerd-font-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-robotomono-nerd-font'
cask 'font-roboto-condensed'
