# tap
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'

# bin
brew 'mackup'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-git-prompt'
brew 'zsh-syntax-highlighting'
brew 'tmux'
brew 'coreutils'
brew 'tree'
brew 'mas'
brew 'wget'
brew 'neovim'
brew 'unrar'
brew 'yarn', args:['without-node']

# utils
cask 'alfred'
cask 'bettertouchtool'
cask 'skype'
cask 'slack'
cask 'vlc'
cask 'webtorrent'
cask 'screenflow'
cask 'vysor'
cask 'kid3'
cask 'openemu-experimental'
cask 'sip'
cask 'disk-inventory-x'
cask 'spotify'
cask 'microsoft-remote-desktop-beta'
cask 'typora'
cask 'avibrazil-rdm'
cask 'movist'
cask 'vanilla'
cask 'kap'
cask 'zoomus'
cask 'marp'
cask 'kindle'
cask 'hyper'
cask 'mindnode-pro'
cask 'notion'
cask 'there'
cask 'google-backup-and-sync'

# browsers
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'chromium'
cask 'safari-technology-preview'
cask 'firefox'
cask 'firefox-nightly'
cask 'torbrowser'

# development
cask 'docker'
cask 'iterm2'
cask 'android-studio'
cask 'android-file-transfer'
cask 'visual-studio-code'
cask 'visual-studio-code-insiders'
cask 'java'
cask 'devdogs'
brew 'go'
cask 'imageoptim'
brew 'python3'
cask 'zeplin'
cask 'sketch'

# fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-fira-code'
cask 'font-fira-sans'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-robotomono-nerd-font-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-robotomono-nerd-font'
cask 'font-roboto-condensed'
